iGaryGu/Painter/CORTEX_M4F_STM32F4/main.c
#define USE_STDPERIPH_DRIVER
#include "stm32f4xx.h"
#include "stm32_p103.h"
/* Scheduler includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include <string.h>

/* Filesystem includes */
#include "filesystem.h"
#include "fio.h"
#include "romfs.h"

#include "clib.h"
#include "shell.h"
#include "host.h"

#define PHASE_DELAY 150
/* _sromfs symbol can be found in main.ld linker script
 * it contains file system structure of test_romfs directory
 */
extern const unsigned char _sromfs;

//static void setup_hardware();

volatile xSemaphoreHandle serial_tx_wait_sem = NULL;
/* Add for serial input */
volatile xQueueHandle serial_rx_queue = NULL;

/* IRQ handler to handle USART2 interruptss (both transmit and receive
 * interrupts). */
void USART1_IRQHandler()
{
	static signed portBASE_TYPE xHigherPriorityTaskWoken;

	/* If this interrupt is for a transmit... */
	if (USART_GetITStatus(USART1, USART_IT_TXE) != RESET) {
		/* "give" the serial_tx_wait_sem semaphore to notfiy processes
		 * that the buffer has a spot free for the next byte.
		 */
		xSemaphoreGiveFromISR(serial_tx_wait_sem, &xHigherPriorityTaskWoken);

		/* Diables the transmit interrupt. */
		USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
		/* If this interrupt is for a receive... */
	}else if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET){
		char msg = USART_ReceiveData(USART1);

		/* If there is an error when queueing the received byte, freeze! */
		if(!xQueueSendToBackFromISR(serial_rx_queue, &msg, &xHigherPriorityTaskWoken))
			while(1);
	}
	else {
		/* Only transmit and receive interrupts should be enabled.
		 * If this is another type of interrupt, freeze.
		 */
		while(1);
	}

	if (xHigherPriorityTaskWoken) {
		taskYIELD();
	}
}

void send_byte(char ch)
{
	/* Wait until the RS232 port can receive another byte (this semaphore
	 * is "given" by the RS232 port interrupt when the buffer has room for
	 * another byte.
	 */
	while (!xSemaphoreTake(serial_tx_wait_sem, portMAX_DELAY));

	/* Send the byte and enable the transmit interrupt (it is disabled by
	 * the interrupt).
	 */
	USART_SendData(USART1, ch);
	USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
}

char recv_byte()
{
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	char msg;
	while(!xQueueReceive(serial_rx_queue, &msg, portMAX_DELAY));
	return msg;
}
void command_prompt(void *pvParameters)
{
	char buf[128];
	char *argv[20];
        char hint[] = USER_NAME "@" USER_NAME "-STM32:~$ ";

	LCD_SetColors(0xFFFF, 0x0000);//white
	LCD_DisplayChar(20, 20, 75);
	fio_printf(1, "\rWelcome to FreeRTOS Shell\r\n");
	while(1){
                fio_printf(1, "%s", hint);
		fio_read(0, buf, 127);
		int n=parse_command(buf, argv);
		/* will return pointer to the command function */
		cmdfunc *fptr=do_command(argv[0]);
		LCD_DisplayStringLine(0, argv[0]);
		if(fptr!=NULL)
			fptr(n, argv);
		else
			fio_printf(2, "\r\n\"%s\" command not found.\r\n", argv[0]);
	}

}

void system_logger(void *pvParameters)
{
    signed char buf[128];
    char output[512] = {0};
    char *tag = "\nName          State   Priority  Stack  Num\n*******************************************\n";
    int handle, error;
    const portTickType xDelay = 100000 / 100;
    host_action(SYS_SYSTEM, "mkdir output");
    handle = host_action(SYS_OPEN, "output/syslog", 4);
    if(handle == -1) {
	fio_printf(1, "Open file error!\n");
        return;
    }

    while(1) {
        memcpy(output, tag, strlen(tag));
        error = host_action(SYS_WRITE, handle, (void *)output, strlen(output));
        if(error != 0) {
            fio_printf(1, "Write file error! Remain %d bytes didn't write in the file.\n\r", error);
            host_action(SYS_CLOSE, handle);
            return;
        }
        vTaskList(buf);

        memcpy(output, (char *)(buf + 2), strlen((char *)buf) - 2);

        error = host_action(SYS_WRITE, handle, (void *)buf, strlen((char *)buf));
        if(error != 0) {
            fio_printf(1, "Write file error! Remain %d bytes didn't write in the file.\n\r", error);
            host_action(SYS_CLOSE, handle);
            return;
        }

        vTaskDelay(xDelay);
    }
    
    host_action(SYS_CLOSE, handle);
}

void gpio_init(){
	// AHB clock
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_9 | GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(GPIOG, &GPIO_InitStructure);
}
void Delay(uint32_t volatile DelayTime_uS){
	uint32_t DelayTime = 0;
	DelayTime = SystemCoreClock/1000000*DelayTime_uS;
	for(;DelayTime != 0 ; DelayTime--)
		__NOP();
}

void clockwise(int n)
{
	GPIO_ResetBits(GPIOG, GPIO_Pin_9 | GPIO_Pin_10 | \
	               GPIO_Pin_13 | GPIO_Pin_14);
	for(int i = 0; i < n; i++) {
		GPIO_SetBits(GPIOG, GPIO_Pin_14);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_13);
		Delay(PHASE_DELAY);
		GPIO_ToggleBits(GPIOG, GPIO_Pin_14);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_10);
		Delay(PHASE_DELAY);
		GPIO_ToggleBits(GPIOG, GPIO_Pin_13);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_9);
		Delay(PHASE_DELAY);
		GPIO_ToggleBits(GPIOG, GPIO_Pin_10);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_14);
		Delay(PHASE_DELAY);
	}
}
void counterClockwise(int n)
{
	GPIO_ResetBits(GPIOG, GPIO_Pin_9 | GPIO_Pin_10 | \
	               GPIO_Pin_13 | GPIO_Pin_14);
	for(int i = 0; i < n; i++) {
		GPIO_SetBits(GPIOG, GPIO_Pin_9);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_10);
		Delay(PHASE_DELAY);
		GPIO_ToggleBits(GPIOG, GPIO_Pin_9);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_13);
		Delay(PHASE_DELAY);
		GPIO_ToggleBits(GPIOG, GPIO_Pin_10);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_14);
		Delay(PHASE_DELAY);
		GPIO_ToggleBits(GPIOG, GPIO_Pin_13);
		Delay(PHASE_DELAY);
		GPIO_SetBits(GPIOG, GPIO_Pin_9);
		Delay(PHASE_DELAY);
	}
}
int main()
{
	//init_rs232();
	//enable_rs232_interrupts();
	//enable_rs232();
	gpio_init();
	//while(1){
	//}
	fs_init();
	fio_init();
	clockwise(512);
	counterClockwise(512);
	//display the shell
	//struct graph_info *graph;
	LCD_Init();
	//IOE_Config();
	LTDC_Cmd(ENABLE);
	LCD_LayerInit();
	LCD_SetLayer( 0x0001 );
	LCD_Clear( 0x0000 );
	LCD_SetTextColor( 0xFFFF );
	//register_romfs("romfs", &_sromfs);
	
	/* Create the queue used by the serial task.  Messages for write to
	 * the RS232. */
	vSemaphoreCreateBinary(serial_tx_wait_sem);
	/* Add for serial input 
	 * Reference: www.freertos.org/a00116.html */
	serial_rx_queue = xQueueCreate(1, sizeof(char));

	/* Create a task to output text read from romfs. */
	xTaskCreate(command_prompt,
	            (signed portCHAR *) "CLI",
	            512  /*stack size*/ , NULL, tskIDLE_PRIORITY + 2, NULL);

	/* Create a task to record system log. */
	/*xTaskCreate(system_logger,
	            (signed portCHAR *) "Logger",
	            1024  stack size , NULL, tskIDLE_PRIORITY + 1, NULL);*/

	/* Start running the tasks. */
	vTaskStartScheduler();

	return 0;
}

void vApplicationTickHook()
{
}
